tests/golden/openfoam/cavity/system/controlDict
// Generated by OpenSolver Workbench OpenFOAM template adapter.
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     icoFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1;

deltaT          0.005;

writeControl    runTime;
writeInterval   0.1;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;

runTimeModifiable true;
